<a href="https://colab.research.google.com/github/GPrathap/pythonII/blob/master/master/lesson3/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Section 00**: Introduction

In [1]:
import pandas as pd

**DataFrame** and **Series** are the main objects in pandas

**DataFrame** can be considered as a table. A table is an arrangement of information or data, typically in rows and columns form. In pandas, each column represents an array, namely entry, each of which has a certain value.

To use the pandas, the first step is to import the library as follows:

# **Section 01:** Creating, Reading, and Writing

**Creating data**

Consider the following example:

In [ ]:

pd.DataFrame({"Age":[15, 16], "Height":[140, 155]})

   Age  Height
0   15     140
1   16     155

In this example, **"0, Age"** entry has the value of 15. Similarly, 155 belongs to **"1,Height"** entry. Here, 0 and 1 are the indices.  Instead of 0 and 1, if there is a way to give proper labels for indices, it would be better for several reasons. Let's talk about those reasons bits later. Let's have a look at how to add indices

In [ ]:
pd.DataFrame({"Age":[15,16], "Height":[140, 155]}, index=["student1", "student2"])

          Age  Height
student1   15     140
student2   16     155

Let's say we want to add person names as well. Can we include the name in the same DataFrame we created? Yes, it does. DataFrame is not limited to the same data type, e.g., integer it supports multiple datatypes

In [ ]:
pd.DataFrame({"Age":[15, 16], "Height":[140, 155], "Name":["Tom Lul", "Tim Dima"]}, index=["student1", "student2"])

          Age  Height      Name
student1   15     140   Tom Lul
student2   16     155  Tim Dima

**Series** 

A **Series**, by contrast, is a sequence of data values. Since **DataFrame** is a table, **Series** is a column of a DataFrame. In other words, DataFrame is a collection of Series. Let's try to construct the above DataFrame using Series object

In [ ]:
age = pd.Series([15,16], index=["student1", "student2"], name="age")
height = pd.Series([140, 155], index=["student1", "student2"], name="height")
name = pd.Series(["Tom Lul", "Tim Dima"], index=["student1", "student2"], name="name")

df = pd.DataFrame({"Age": age, "Height":height, "Name":name})
df

          Age  Height      Name
student1   15     140   Tom Lul
student2   16     155  Tim Dima

**Reading and Writing files**

If you want to save the student information

In [ ]:
df.to_csv("/content/sample_data/student_info.csv", index="true", header="true")

How can we read the data form a file?

In [ ]:
df_mod = pd.read_csv("/content/sample_data/student_info.csv")
df_mod

  Unnamed: 0  Age  Height      Name
0   student1   15     140   Tom Lul
1   student2   16     155  Tim Dima

In [ ]:
df_mod = pd.read_csv("/content/sample_data/student_info.csv", index_col=0)
df_mod

          Age  Height      Name
student1   15     140   Tom Lul
student2   16     155  Tim Dima

In [ ]:
df_mod.head()

          Age  Height      Name
student1   15     140   Tom Lul
student2   16     155  Tim Dima

# **Section 02**: Accessing, Indexing, Selecting, and Assigning

**Accessing the data** 

In Python, the properties of an object can be accessed by those attributes. DataFrame works in much as the same way

In [ ]:
df_mod.Age

student1    15
student2    16
Name: Age, dtype: int64

In [ ]:
df_mod['Age']

student1    15
student2    16
Name: Age, dtype: int64

In [ ]:
df_mod['Age']['student1']

15

In [ ]:
df_mod['Age'][0]

15

**Indexing** 

As shown in the latter example, the indexing operator in Pandas works in much the same way. Yet, for advance operations Panda offers two accessor operations: 

**loc**: index-based selection (selecting based on its numerical position)

**iloc**: label-based selection (selecting based on its index value not the position)

In [ ]:
df_mod.loc['student1']

Age            15
Height        140
Name      Tom Lul
Name: student1, dtype: object

In [ ]:
df_mod.iloc[0]

Age            15
Height        140
Name      Tom Lul
Name: student1, dtype: object

In [ ]:
df_mod.loc['student1', 'Age']

15

In [ ]:
df_mod.iloc[0,0]

15

In [ ]:
df_mod.loc['student1', ['Age', 'Height']]

Age        15
Height    140
Name: student1, dtype: object

In [ ]:
df_mod.iloc[0, [0,1]]

Age        15
Height    140
Name: student1, dtype: object

In [ ]:
df_mod.iloc[0,:]

Age            15
Height        140
Name      Tom Lul
Name: student1, dtype: object

In [ ]:
df_mod.loc[['student1', 'student2'], 'Age']

student1    15
student2    16
Name: Age, dtype: int64

In [ ]:
df_mod.iloc[[0,1], 0]

student1    15
student2    16
Name: Age, dtype: int64

In [ ]:
df_mod.loc[:, "Age"]

student1    15
student2    16
Name: Age, dtype: int64

In [ ]:
df_mod.iloc[:, 0]

student1    15
student2    16
Name: Age, dtype: int64

In [ ]:
df_mod.iloc[-1]

Age             16
Height         155
Name      Tim Dima
Name: student2, dtype: object

**Manipulating the index**

In Pandas, an index is not immutable. Hence, we have the freedom to modify the index in the way we want. Let's say we want to index based on the names of students

In [ ]:
df_mod

          Age  Height      Name
student1   15     140   Tom Lul
student2   16     155  Tim Dima

In [ ]:
df_mod.set_index("Name")

          Age  Height
Name
Tom Lul    15     140
Tim Dima   16     155

Or how can we rename the index completely? you can use `set_aixs` to replace any *axis*

In [ ]:
df_mod.set_axis(['s1', 's2'], axis='index')

    Age  Height      Name
s1   15     140   Tom Lul
s2   16     155  Tim Dima

In [ ]:
df_mod.set_axis(['s1', 's2'], axis=0)

    Age  Height      Name
s1   15     140   Tom Lul
s2   16     155  Tim Dima

Can you guess `df_mod.set_axis(['age', 'height', 'name'], axis=1)` result of this?

**Different way of selections**

Let's say, in the class, we have a few more people, but still, there are some information is missing

In [ ]:
import numpy as np 

df_new = pd.DataFrame({"Age":[15, 16, np.nan, 18], "Height":[140, 155, 167, np.nan]
                       , "Name":["Tom Lul", "Tim Dima", "Bulad Max", "Savira Lavix"]}
                      , index=["student1", "student2", "student3", "student4"])
df_new

           Age  Height          Name
student1  15.0   140.0       Tom Lul
student2  16.0   155.0      Tim Dima
student3   NaN   167.0     Bulad Max
student4  18.0     NaN  Savira Lavix

How can we know all the students' names who are higher than 150 cm?

Let's go through step by step

In [ ]:
df_new.Height>=150 #selecting students who are higher than 150cm. In the result

student1    False
student2     True
student3     True
student4    False
Name: Height, dtype: bool

In [ ]:
df_new.loc[df_new.Height >= 150]  # this gives the part of the DataFrame we are interested in

           Age  Height       Name
student2  16.0   155.0   Tim Dima
student3   NaN   167.0  Bulad Max

`df_new.loc[df_new.Height >= 150]` same work can be done incorporating `np.where` API as well

In [ ]:
np.where(df_new.Height>=150)[0] # this gives indicis of those students

array([1, 2])

In [ ]:
df_new.iloc[np.where(df_new.Height>=150)[0]] # this gives the part of the DataFrame we are interested in

           Age  Height       Name
student2  16.0   155.0   Tim Dima
student3   NaN   167.0  Bulad Max

In [ ]:
df_new.loc[df_new.Height >= 150].Name #since names of those students what what we need. Retriving only the names

student2     Tim Dima
student3    Bulad Max
Name: Name, dtype: object

In [ ]:
df_new.iloc[np.where(df_new.Height>=150)[0]].Name

student2     Tim Dima
student3    Bulad Max
Name: Name, dtype: object

Now let's say, we need students who are higher than 150 and whose age higher than 16

In [ ]:
df_new.loc[ (df_new.Height > 150) & (df_new.Age >= 16)]

           Age  Height      Name
student2  16.0   155.0  Tim Dima

How about students who are higher than 150 or age higher than 16

In [ ]:
df_new.loc[ (df_new.Height > 150) | (df_new.Age >= 16)]

           Age  Height          Name
student2  16.0   155.0      Tim Dima
student3   NaN   167.0     Bulad Max
student4  18.0     NaN  Savira Lavix

As you can see, here for some information are missing, i.e., information that provided with NaN

How to retrieve students who have missing information

In [ ]:
df_new.loc[df_new.Age.isin([np.nan]) | df_new.Height.isin([np.nan]) | df_new.Name.isin([np.nan])]

           Age  Height          Name
student3   NaN   167.0     Bulad Max
student4  18.0     NaN  Savira Lavix

How to retrieve students who have provided their height

In [ ]:
df_new.loc[ df_new.Height.notnull()]

           Age  Height       Name
student1  15.0   140.0    Tom Lul
student2  16.0   155.0   Tim Dima
student3   NaN   167.0  Bulad Max

**Assigning data** 

Student3 age is 17. How can you update the corresponding entry?

In [ ]:
df_new['Age'].student3 = 17
df_new

/usr/local/lib/python3.7/dist-packages/pandas/core/generic.py:5170: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self[name] = value

           Age  Height          Name
student1  15.0   140.0       Tom Lul
student2  16.0   155.0      Tim Dima
student3  17.0   167.0     Bulad Max
student4  18.0     NaN  Savira Lavix

In [ ]:
df_new['Age'][2] = 17
df_new

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

           Age  Height          Name
student1  15.0   140.0       Tom Lul
student2  16.0   155.0      Tim Dima
student3  17.0   167.0     Bulad Max
student4  18.0     NaN  Savira Lavix

# **Section 03**: Building Summary Functions and Maps

**Build-in summary functions**

There are several useful APIs that can be used for describing and visualization properties of data

In [ ]:
df_new = pd.DataFrame({"age":[15, 16, np.nan, 18], "height":[140, 155, 167, np.nan]
                       , "name":["Tom Lul", "Tim Maxwell", "Tim Dima", "Savi Lavix"], "mark":[45, 67, 89, 67]}
                      , index=["student1", "student2", "student3", "student4"])
df_new

           age  height         name  mark
student1  15.0   140.0      Tom Lul    45
student2  16.0   155.0  Tim Maxwell    67
student3   NaN   167.0     Tim Dima    89
student4  18.0     NaN   Savi Lavix    67

Let's see what it describes in default

In [ ]:
df_new.describe()

             age      height       mark
count   3.000000    3.000000   4.000000
mean   16.333333  154.000000  67.000000
std     1.527525   13.527749  17.962925
min    15.000000  140.000000  45.000000
25%    15.500000  147.500000  61.500000
50%    16.000000  155.000000  67.000000
75%    17.000000  161.000000  72.500000
max    18.000000  167.000000  89.000000

In [ ]:
df_new.describe(include='all')

              age      height     name       mark
count    3.000000    3.000000        4   4.000000
unique        NaN         NaN        4        NaN
top           NaN         NaN  Tom Lul        NaN
freq          NaN         NaN        1        NaN
mean    16.333333  154.000000      NaN  67.000000
std      1.527525   13.527749      NaN  17.962925
min     15.000000  140.000000      NaN  45.000000
25%     15.500000  147.500000      NaN  61.500000
50%     16.000000  155.000000      NaN  67.000000
75%     17.000000  161.000000      NaN  72.500000
max     18.000000  167.000000      NaN  89.000000

In [ ]:
df_new.name.describe()

count           4
unique          4
top       Tom Lul
freq            1
Name: name, dtype: object

In [ ]:
df_new.mark.describe()

count     4.000000
mean     67.000000
std      17.962925
min      45.000000
25%      61.500000
50%      67.000000
75%      72.500000
max      89.000000
Name: mark, dtype: float64

In [ ]:
df_new.mark.mean()

67.0

In [ ]:
df_new.name.value_counts()

Tom Lul        1
Savi Lavix     1
Tim Dima       1
Tim Maxwell    1
Name: name, dtype: int64

**Mapping** 

In general, mapping means apply a transformation, e.g., function, a given set of values into another set of values. For example, say we need to understand how marks are deviated around its of the mean

In [ ]:
marks_mean = df_new.mark.mean()

def centering(row):
  return row.mark - marks_mean 

df_new.apply(centering, axis="columns")

student1   -22.0
student2     0.0
student3    22.0
student4     0.0
dtype: float64

the same things can be done in the following:

In [ ]:
df_new.mark.map(lambda p: p-marks_mean)

student1   -22.0
student2     0.0
student3    22.0
student4     0.0
Name: mark, dtype: float64

# **Section 04**: Grouping

**Groupwise Operations**

In [ ]:
df_new.groupby('mark').mark.count()

mark
45    1
67    2
89    1
Name: mark, dtype: int64

In [ ]:
df_new.groupby('mark').apply(lambda df: df.height)

mark
45    student1    140.0
67    student2    155.0
      student4      NaN
89    student3    167.0
Name: height, dtype: float64

In [ ]:
df_new.groupby(['mark', 'age']).apply(lambda df: df.height)

mark  age
45    15.0  student1    140.0
67    16.0  student2    155.0
      18.0  student4      NaN
Name: height, dtype: float64

In [ ]:
df_new.groupby('mark').apply(lambda df: df.mark).agg([len, min, max])

len     4
min    45
max    89
Name: mark, dtype: int64

# **Section 05**: Data Types and Missing Values

**Dealing with missing data**

Data type of each column can be check by accessing **dtype** property

In [ ]:

df_new.age.dtype

dtype('float64')

In [ ]:
df_new.dtypes

age       float64
height    float64
name       object
mark        int64
dtype: object

Data type any entry can be changed using **astype(dtype)** function. In general, age is represented in an integer. Can you use change the age column into integer values? Since one value is not defined, NaN, the first step is to remove those undefined values

In [ ]:
#df_new.age.astype(np.int) #You will get an error

In [ ]:
pd.isnull(df_new.age)

student1    False
student2    False
student3     True
student4    False
Name: age, dtype: bool

In [ ]:
df_new.age.isnull()

student1    False
student2    False
student3     True
student4    False
Name: age, dtype: bool

In [ ]:
df_new.age[~df_new.age.isnull()]

student1    15.0
student2    16.0
student4    18.0
Name: age, dtype: float64

In [ ]:
df_new.age[~df_new.age.isnull()].astype("int64")

student1    15
student2    16
student4    18
Name: age, dtype: int64

In [ ]:
df_new.age.fillna("Unknown")

student1         15
student2         16
student3    Unknown
student4         18
Name: age, dtype: object

Now type if age becomes object since datatypes are mixed of integer and string. Moreover, if we know the values to be replaced, we can use the **replace** function

In [ ]:
df_new.age

student1    15.0
student2    16.0
student3     NaN
student4    18.0
Name: age, dtype: float64

In [ ]:
df_new.age = df_new.age.replace(np.nan, 45)

# **Section 06**: Renaming and Combining

**Renaming**

We can rename any column or index using rename() function

In [ ]:
df_new.rename(columns={'name':"full_name"})

           age  height    full_name  mark
student1  15.0   140.0      Tom Lul    45
student2  16.0   155.0  Tim Maxwell    67
student3  45.0   167.0     Tim Dima    89
student4  18.0     NaN   Savi Lavix    67

In [ ]:
df_new.rename(index={'student1':'s1', 'student3':'s3'})

           age  height         name  mark
s1        15.0   140.0      Tom Lul    45
student2  16.0   155.0  Tim Maxwell    67
s3        45.0   167.0     Tim Dima    89
student4  18.0     NaN   Savi Lavix    67

In order to to rename or add axis names, we can use **rename_axis()**

In [ ]:
df_new.rename_axis("index", axis="rows").rename_axis("information", axis='columns')

information   age  height         name  mark
index
student1     15.0   140.0      Tom Lul    45
student2     16.0   155.0  Tim Maxwell    67
student3     45.0   167.0     Tim Dima    89
student4     18.0     NaN   Savi Lavix    67

**Combining** 

Let's say class A and class B student details are given as follows:

In [ ]:
class_A = pd.DataFrame({"age":[15, 16, 23, 18], "height":[140, 155, 167, 178]
                       , "name":["Tom Lul", "Tim Maxwell", "Tim Dima", "Savi Lavix"], "mark":[45, 67, 89, 67]}
                      , index=["a_s1", "a_s2", "a_s3", "a_s4"])
class_A

      age  height         name  mark
a_s1   15     140      Tom Lul    45
a_s2   16     155  Tim Maxwell    67
a_s3   23     167     Tim Dima    89
a_s4   18     178   Savi Lavix    67

In [ ]:

class_B = pd.DataFrame({"age":[16, 14, 19, 16], "height":[120, 175, 187, 146]
                       , "name":["Mina Vox", "Luna Bulad", "Bulga Martib", "Savin Lulax"], "mark":[4,45, 28, 89]}
                      , index=["b_s1", "b_s2", "b_s3", "b_s4"])
class_B

      age  height          name  mark
b_s1   16     120      Mina Vox     4
b_s2   14     175    Luna Bulad    45
b_s3   19     187  Bulga Martib    28
b_s4   16     146   Savin Lulax    89

Now we need to check who scored the maximum mark? How can we do this?

In [ ]:
classes = pd.concat([class_A, class_B])
classes

      age  height          name  mark
a_s1   15     140       Tom Lul    45
a_s2   16     155   Tim Maxwell    67
a_s3   23     167      Tim Dima    89
a_s4   18     178    Savi Lavix    67
b_s1   16     120      Mina Vox     4
b_s2   14     175    Luna Bulad    45
b_s3   19     187  Bulga Martib    28
b_s4   16     146   Savin Lulax    89

In [ ]:
classes.age.idxmax()

'a_s3'

Let's say we want to find the students with same age

In [ ]:
classes.groupby("age").apply(lambda df: df.age)

age
14   b_s2    14
15   a_s1    15
16   a_s2    16
     b_s1    16
     b_s4    16
18   a_s4    18
19   b_s3    19
23   a_s3    23
Name: age, dtype: int64